# Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

dict = {
    0: "\u2070",
    1: "\u00B9",
    2: "\u00B2",
    3: "\u00B3",
    4: "\u2074",
    5: "\u2075",
    6: "\u2076",
    7: "\u2077",
    8: "\u2078",
    9: "\u2079",
    10: "\u00B9"+"\u2070",
    11: "\u00B9"+"\u00B9",
    12: "\u00B9"+"\u00B2",
    13: "\u00B9"+"\u00B3",
    14: "\u00B9"+"\u2074",
    15: "\u00B9"+"\u2075"
}

a = True
i = 0

while a:
    try:
        n = int(input("Введите число: "))
        if n >= 0:
            a = False
        else:
            print("Введите положительное число")
    except:
        print("Введите число!")

while 2**i <= n:
    print(str(2) + dict[i], "=", 2**i)
    i += 1
